---
kind: method
id: M:Autodesk.Revit.DB.SpatialElement.GetSpatialElementDomainData
source: html/b116ed4e-6d61-3c00-74af-3689e47fe6d0.htm
---
# Autodesk.Revit.DB.SpatialElement.GetSpatialElementDomainData Method

Gets the domain data for the spatial element. The domain data contains information of different spatial elements, such as electrical load area. Currently room/space/area don't have domain data.

## Syntax (C#)
```csharp
public SpatialElementDomainData GetSpatialElementDomainData()
```

## Returns
Returns a pointer to the base class for specific domain requirements for the spatial element.